# series object in one-dimensional labeled array

In [1]:
import pandas as pd

In [2]:
s1=pd.Series([1,2,3,4,5])

In [3]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
type(s1)

pandas.core.series.Series

# series can be indexed and change to its value

In [5]:
s2=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [6]:
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

# we can also create a series object from a dict

In [7]:
import pandas as pd

In [8]:
s3=pd.Series({'a':10,'b':20,'c':30})

In [9]:
s3

a    10
b    20
c    30
dtype: int64

# we can change the index position

In [10]:
import pandas as pd

In [11]:
pd.Series({'a':10,'b':20,'c':30},index=['b','c','d','a'])

b    20.0
c    30.0
d     NaN
a    10.0
dtype: float64

# Extracting the individual values on series

In [12]:
s11=pd.Series([1,2,3,4,5,6,7,8,9])
s22=pd.Series([10,20,30,40,50,60,70,80,90])

In [13]:
s11

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [14]:
s22

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [15]:
s11[2]

3

In [16]:
s11[2:5]

2    3
3    4
4    5
dtype: int64

In [17]:
s11[-5:]

4    5
5    6
6    7
7    8
8    9
dtype: int64

# Basis math operation on series

In [18]:
s11+10

0    11
1    12
2    13
3    14
4    15
5    16
6    17
7    18
8    19
dtype: int64

In [19]:
s11*10

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [20]:
s11-10

0   -9
1   -8
2   -7
3   -6
4   -5
5   -4
6   -3
7   -2
8   -1
dtype: int64

In [21]:
s11+s22

0    11
1    22
2    33
3    44
4    55
5    66
6    77
7    88
8    99
dtype: int64

In [22]:
s11*s22

0     10
1     40
2     90
3    160
4    250
5    360
6    490
7    640
8    810
dtype: int64

In [23]:
s11/s22

0    0.1
1    0.1
2    0.1
3    0.1
4    0.1
5    0.1
6    0.1
7    0.1
8    0.1
dtype: float64

In [24]:
s11/2

0    0.5
1    1.0
2    1.5
3    2.0
4    2.5
5    3.0
6    3.5
7    4.0
8    4.5
dtype: float64

# creating a dataframe

In [25]:
import pandas as pd

In [26]:
df1=pd.DataFrame({"Name":['Thomas','Srishti','Anuroop'],"Marks":[98,99,97]})

In [27]:
df1

      Name  Marks
0   Thomas     98
1  Srishti     99
2  Anuroop     97

In [28]:
df1.shape

(3, 2)

In [29]:
df1.head()

      Name  Marks
0   Thomas     98
1  Srishti     99
2  Anuroop     97

In [30]:
df1.tail()

      Name  Marks
0   Thomas     98
1  Srishti     99
2  Anuroop     97

In [31]:
df1.describe()

       Marks
count    3.0
mean    98.0
std      1.0
min     97.0
25%     97.5
50%     98.0
75%     98.5
max     99.0

# working with the iris datasets

In [32]:
df=pd.read_csv('DataSets/iris.csv')

In [33]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [34]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [35]:
df.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [36]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [37]:
df.iloc[0:3,0:2] # using iloc is exclusive.

   sepal_length  sepal_width
0           5.1          3.5
1           4.9          3.0
2           4.7          3.2

In [38]:
df.loc[5:10,('petal_length','petal_width')] #using loc method is inclusive.

    petal_length  petal_width
5            1.7          0.4
6            1.4          0.3
7            1.5          0.2
8            1.4          0.2
9            1.5          0.1
10           1.5          0.2

In [39]:
df.drop('sepal_length',axis=1) # to drop the column from the dataframe

     sepal_width  petal_length  petal_width    species
0            3.5           1.4          0.2     setosa
1            3.0           1.4          0.2     setosa
2            3.2           1.3          0.2     setosa
3            3.1           1.5          0.2     setosa
4            3.6           1.4          0.2     setosa
..           ...           ...          ...        ...
145          3.0           5.2          2.3  virginica
146          2.5           5.0          1.9  virginica
147          3.0           5.2          2.0  virginica
148          3.4           5.4          2.3  virginica
149          3.0           5.1          1.8  virginica

[150 rows x 4 columns]

In [40]:
df.drop([3,4,5,6,7]) #to drop the rows for the dataframe

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
8             4.4          2.9           1.4          0.2     setosa
9             4.9          3.1           1.5          0.1     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[145 rows x 5 columns]

In [41]:
df.mean()

C:\Users\thoma\AppData\Local\Temp\ipykernel_12664\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

sepal_length    5.843333
sepal_width     3.054000
petal_length    3.758667
petal_width     1.198667
dtype: float64

In [42]:
df.median()

C:\Users\thoma\AppData\Local\Temp\ipykernel_12664\530051474.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.median()

sepal_length    5.80
sepal_width     3.00
petal_length    4.35
petal_width     1.30
dtype: float64

In [43]:
df.min()

sepal_length       4.3
sepal_width        2.0
petal_length       1.0
petal_width        0.1
species         setosa
dtype: object

In [44]:
df.max()

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

In [45]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [46]:
def double_make(s):
    return s*2

In [47]:
df[['sepal_length','petal_width']].apply(double_make)

     sepal_length  petal_width
0            10.2          0.4
1             9.8          0.4
2             9.4          0.4
3             9.2          0.4
4            10.0          0.4
..            ...          ...
145          13.4          4.6
146          12.6          3.8
147          13.0          4.0
148          12.4          4.6
149          11.8          3.6

[150 rows x 2 columns]

In [48]:
df['species'].value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [49]:
df.sort_values(by='petal_length') #sorting in the ascending order

     sepal_length  sepal_width  petal_length  petal_width    species
22            4.6          3.6           1.0          0.2     setosa
13            4.3          3.0           1.1          0.1     setosa
14            5.8          4.0           1.2          0.2     setosa
35            5.0          3.2           1.2          0.2     setosa
36            5.5          3.5           1.3          0.2     setosa
..            ...          ...           ...          ...        ...
131           7.9          3.8           6.4          2.0  virginica
105           7.6          3.0           6.6          2.1  virginica
117           7.7          3.8           6.7          2.2  virginica
122           7.7          2.8           6.7          2.0  virginica
118           7.7          2.6           6.9          2.3  virginica

[150 rows x 5 columns]

In [50]:
df.sort_values(by='petal_length',ascending=False) #sorting in the descending order

     sepal_length  sepal_width  petal_length  petal_width    species
118           7.7          2.6           6.9          2.3  virginica
122           7.7          2.8           6.7          2.0  virginica
117           7.7          3.8           6.7          2.2  virginica
105           7.6          3.0           6.6          2.1  virginica
131           7.9          3.8           6.4          2.0  virginica
..            ...          ...           ...          ...        ...
36            5.5          3.5           1.3          0.2     setosa
35            5.0          3.2           1.2          0.2     setosa
14            5.8          4.0           1.2          0.2     setosa
13            4.3          3.0           1.1          0.1     setosa
22            4.6          3.6           1.0          0.2     setosa

[150 rows x 5 columns]